export const ERR_SERVER = 'Что-то пошло не так, простите';
export const ERR_DUPLICATE = 'А вы уже подписаны';
export const ERR_NOT_SUBSCRIBED = 'Так вы и не подписаны еще';
export const ERR_NO_USER = 'Сначала вы подпишитесь, а потом уж настраивайте фильтры';

export const SUCCESS_SUBSCRIBE = 'Подписка активирована';
export const SUCCESS_UNSUBSCRIBE = 'Вы отписались, я не обиделся';

export const MSG_ABOUT =
  'Этот бот подписан на каналы с объявлениями о сдаче квартир в Тбилиси: он сортирует их по категориям и выдает вам то, на что вы подпишитесь. По сути, он снимает с вас необходимость мониторить 8-10 каналов, он делает это за вас и шлет вам только то, что вам интересно';

export const WELCOME_START =
  'Привет! Этот бот мониторит каналы и присылает тебе новые объявления из них. Настрой его командой /set. Для более подробной информации жми /help';
export const WELCOME_CONFIGURATION =
  'Отлично! Сейчас ты настроишь фильтры по цене и району, чтобы бот слал тебе только нужные объявления';
